W10D4/appit/app/controllers/subs_controller.rb

UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Sub1Descadfgsdfgasfg"], ["updated_at", "2019-08-01 20:57:27.432786"], ["id", 1]]
---
  def update
		@sub = current_user.subs.find(params[:id])

		if @sub.update_attributes(sub_params)