W9D2/ArtShareAPI/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def destroy
    artwork = Artwork.find(params[:id])