W9D2/ArtShareAPI/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "updated_at", "user_id", "artwork_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "OMG this is awesome!"], ["created_at", "2019-07-23 20:02:44.474269"], ["updated_at", "2019-07-23 20:02:44.474269"], ["user_id", 1], ["artwork_id", 2]]
---
  def create
    com = Comment.new(com_params)
    if com.save

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
---
  def index
    # debugger
    if params[:comment][:user_id]
        com = Comment.where(user_id: params[:comment][:user_id])
    elsif params[:comment][:artwork_id]
        com = Comment.where(artwork_id: params[:comment][:artwork_id])

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
---
  def unlike
    like = Like.find_by(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Comment')