W9D2/ArtShareAPI/app/controllers/users_controller.rb

  def index
    # debugger
    if params[:user][:username]
      q = User.where('username LIKE ?', "#{params[:user][:username]}%")
---
SELECT "users".* FROM "users" WHERE (username LIKE "%#{params[:user][:username]}%")